import React, { useEffect, useState } from "react";
import styles from "../../styles/Header.module.css";

function Header() {
    const [showMenu, setShowMenu] = useState(true);

    useEffect(() => {
        const handleScroll = () => {
            setShowMenu(window.scrollY === 0);
        };

        window.addEventListener("scroll", handleScroll, { passive: true });

        return () => {
            window.removeEventListener("scroll", handleScroll);
        };
    }, []);

    return (
        <header className={styles.header}>
            <div className={styles.navbar}>
            
                <div className={styles.navbar__linkBlock}>
                    <svg width="117" height="26" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M36.648 15.669a5.2 5.2 0 0 0 2.514-.632l.645-.35 1.884 1.391c-1.243 1.334-3.075 2.068-5.174 2.068-2.006 0-3.84-.714-5.151-2-1.312-1.285-2.034-3.072-2.034-5.013 0-1.941.733-3.701 2.042-4.94 1.309-1.24 3.142-1.923 5.162-1.923 1.862 0 3.491.567 4.71 1.64l.139.118-2.089 1.542a4.435 4.435 0 0 0-2.648-.83c-2.624 0-4.529 1.878-4.529 4.464 0 2.587 1.905 4.465 4.53 4.465Z" fill="#21A038">
                    </path>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M50.612 9.714h-3.543v-3.02h5.654l3.048-2.25H44.158v13.521h6.074c3.41 0 5.365-1.548 5.365-4.247.003-2.582-1.769-4.004-4.985-4.004Zm-.507 6h-3.036v-3.748h3.036c1.848 0 2.707.627 2.707 1.873 0 1.275-.914 1.874-2.707 1.874Z" fill="#21A038">
                    </path>
                    <path d="m68.51 4.444-3.047 2.25h-4.241v3.307h6.217v2.251h-6.217v3.461h7.288v2.252h-10.2V4.444h10.2Z" fill="#21A038">
                    </path>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M71.22 4.444h5.555c3.543 0 5.742 1.854 5.742 4.838 0 2.985-2.201 4.853-5.744 4.853h-2.64v3.83H71.22V4.444Zm2.912 7.44h2.58c1.865 0 2.891-.922 2.891-2.595 0-1.672-1.026-2.594-2.891-2.594h-2.58v5.188Z" fill="#21A038">
                    </path>
                    <path d="M20.123 4.39c.53.688.983 1.442 1.346 2.244l-10.235 7.587-4.277-2.696V8.282l4.277 2.695 8.889-6.588Z" fill="#21A038">
                    </path>
                    <path d="M2.595 11.296c0-.145.004-.29.01-.434l-2.59-.13a11.294 11.294 0 0 0 3.276 8.552l1.837-1.848a8.691 8.691 0 0 1-2.533-6.14Z" fill="url(#i66655)">
                    </path>
                    <path d="M11.233 2.609c.144 0 .288.005.431.012l.13-2.607A11.167 11.167 0 0 0 3.29 3.31l1.837 1.848a8.587 8.587 0 0 1 6.106-2.548Z" fill="url(#i66654)">
                    </path>
                    <path d="M11.233 19.983c-.145 0-.288-.003-.431-.01l-.13 2.606a11.167 11.167 0 0 0 8.504-3.294l-1.837-1.849a8.594 8.594 0 0 1-6.106 2.547Z" fill="url(#i66653)">
                    </path>
                    <path d="m16.104 4.125 2.185-1.619A11.144 11.144 0 0 0 11.234 0v2.61c1.806-.001 3.482.56 4.87 1.515Z" fill="url(#i66652)">
                    </path>
                    <path d="M22.466 11.296c0-.69-.062-1.367-.18-2.024l-2.418 1.792c.002.077.004.154.004.231 0 2.55-1.1 4.848-2.846 6.439l1.744 1.938a11.294 11.294 0 0 0 3.696-8.376Z" fill="#21A038">
                    </path>
                    <path d="M11.234 19.983a8.597 8.597 0 0 1-6.402-2.861l-1.928 1.753a11.176 11.176 0 0 0 8.33 3.718v-2.61Z" fill="url(#i66651)">
                    </path>
                    <path d="M5.44 4.857 3.698 2.92A11.296 11.296 0 0 0 0 11.296h2.595a8.69 8.69 0 0 1 2.846-6.439Z" fill="url(#i66650)">
                    </path>
                    <path d="M95.845 8.135h-6.703v9.769h-1.42V6.875h9.542v11.029h-1.42V8.135ZM100.098 10.026h1.246v1.513c.2-.463.537-.857 1.01-1.182.473-.326 1.109-.489 1.908-.489 1.052 0 1.887.31 2.508.93.62.62.93 1.618.93 2.993 0 .778-.084 1.44-.252 1.986-.158.535-.394.976-.71 1.323a2.718 2.718 0 0 1-1.12.74c-.441.158-.946.237-1.514.237-.662 0-1.225-.137-1.687-.41-.452-.283-.789-.609-1.01-.977v4.05h-1.309V10.026Zm1.309 4.27c0 .819.226 1.46.679 1.922.462.451 1.067.677 1.813.677.863 0 1.488-.23 1.877-.693.4-.462.6-1.24.6-2.332 0-.525-.058-.966-.174-1.323-.116-.368-.284-.662-.505-.882a1.774 1.774 0 0 0-.772-.473 3.403 3.403 0 0 0-1.01-.142c-.82 0-1.44.22-1.861.662-.41.43-.626 1.04-.647 1.828v.756ZM108.987 13.933c0-.682.1-1.276.299-1.78.2-.515.474-.94.821-1.276a3.36 3.36 0 0 1 1.23-.756 4.585 4.585 0 0 1 1.546-.253c1.24.011 2.202.358 2.886 1.04.683.683 1.025 1.712 1.025 3.088 0 .683-.1 1.282-.3 1.796a3.531 3.531 0 0 1-.82 1.26 3.36 3.36 0 0 1-1.23.757 4.585 4.585 0 0 1-1.546.252c-1.251-.01-2.218-.352-2.902-1.024-.673-.683-1.009-1.717-1.009-3.104Zm1.325.048c0 1.018.22 1.764.662 2.237.442.473 1.083.709 1.924.709.831 0 1.467-.242 1.909-.725.441-.494.662-1.229.662-2.206v-.047c0-1.008-.226-1.749-.678-2.221-.442-.473-1.078-.715-1.908-.725-.831 0-1.467.247-1.909.74-.442.483-.662 1.213-.662 2.19v.048Z" fill="#21A038">
                    </path>
                    <defs>
                        <linearGradient id="i66655" x1="3.816" y1="18.957" x2="0.952" y2="10.725" gradientUnits="userSpaceOnUse">
                        <stop offset="0.144" stop-color="#F2E913">
                        </stop>
                        <stop offset="0.304" stop-color="#E7E518">
                        </stop>
                        <stop offset="0.582" stop-color="#CADB26">
                        </stop>
                        <stop offset="0.891" stop-color="#A3CD39">
                        </stop>
                        </linearGradient>
                        <linearGradient id="i66654" x1="4.031" y1="3.77" x2="11.344" y2="0.999" gradientUnits="userSpaceOnUse">
                        <stop offset="0.059" stop-color="#0FA8E0">
                        </stop>
                        <stop offset="0.538" stop-color="#0099F9">
                        </stop>
                        <stop offset="0.923" stop-color="#0291EB">
                        </stop>
                        </linearGradient>
                        <linearGradient id="i66653" x1="10.501" y1="21.018" x2="18.763" y2="19.161" gradientUnits="userSpaceOnUse">
                        <stop offset="0.123" stop-color="#A3CD39">
                        </stop>
                        <stop offset="0.285" stop-color="#86C339">
                        </stop>
                        <stop offset="0.869" stop-color="#21A038">
                        </stop>
                        </linearGradient>
                        <linearGradient id="i66652" x1="10.691" y1="0.874" x2="17.758" y2="3.042" gradientUnits="userSpaceOnUse">
                        <stop offset="0.057" stop-color="#0291EB">
                        </stop>
                        <stop offset="0.79" stop-color="#0C8ACB">
                        </stop>
                        </linearGradient>
                        <linearGradient id="i66651" x1="3.555" y1="18.557" x2="11.251" y2="21.417" gradientUnits="userSpaceOnUse">
                        <stop offset="0.132" stop-color="#F2E913">
                        </stop>
                        <stop offset="0.298" stop-color="#EBE716">
                        </stop>
                        <stop offset="0.531" stop-color="#D9E01F">
                        </stop>
                        <stop offset="0.802" stop-color="#BBD62D">
                        </stop>
                        <stop offset="0.983" stop-color="#A3CD39">
                        </stop>
                        </linearGradient>
                        <linearGradient id="i66650" x1="0.967" y1="11.612" x2="4.083" y2="3.553" gradientUnits="userSpaceOnUse">
                        <stop offset="0.07" stop-color="#A3CD39">
                        </stop>
                        <stop offset="0.26" stop-color="#81C55F">
                        </stop>
                        <stop offset="0.922" stop-color="#0FA8E0">
                        </stop>
                        </linearGradient>
                    </defs>
                    </svg>
                    <a className={styles.navbar__mediaLink} href='#'>Медиа</a>
                    <a className={styles.navbar__liveLink} href='#'>Live</a>
                    <a className={styles.navbar__cifrusLink} href='#'>Цифровое развитие</a>
                </div>

                <div className={styles.navbar__btnBlock}>
                    <a className={styles.navbar__buisnessBtn} href='#'>Бизнес решения</a>
                    <div className={styles.navbar__linkBtn}>
                        <svg width="16" height="16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M12.936 3.212c-.312.094-.743.295-1.454.63L2.677 7.994a15.757 15.757 0 0 0-.577.281l.04.019c.119.054.287.122.552.229.563.227.757.303.941.349a3 3 0 0 0 1.98-.182c.172-.079.35-.189.862-.514l1.823-1.16.004-.002.01-.006a1.034 1.034 0 0 1 .105-.057c.807-.376 1.67.402 1.381 1.244a1.009 1.009 0 0 1-.045.11l-.005.011-.002.004c-.164.329-.22.444-.26.54a3 3 0 0 0 1.056 3.587c.085.06.195.126.51.313l.815.485c.23.137.367.218.47.272l.024.012.003-.027c.014-.115.024-.274.04-.541l.502-8.153c.048-.785.075-1.26.047-1.584l-.001-.016-.016.004Zm-.578-1.915c.499-.15 1.162-.246 1.774.17.613.415.769 1.066.814 1.585.042.49.003 1.117-.04 1.807l-.507 8.249c-.014.234-.027.45-.048.626-.021.18-.058.408-.16.635a2 2 0 0 1-2.165 1.145 2.117 2.117 0 0 1-.616-.225 12.334 12.334 0 0 1-.545-.313l-.872-.519a9.835 9.835 0 0 1-.6-.373 5 5 0 0 1-2.128-4.041c-.318.2-.564.349-.82.466a5 5 0 0 1-3.3.303c-.333-.084-.662-.217-1.138-.409a48.81 48.81 0 0 0-.063-.025l-.02-.008c-.24-.097-.449-.181-.613-.256a2.22 2.22 0 0 1-.547-.332 2 2 0 0 1-.085-2.935 2.22 2.22 0 0 1 .528-.362c.16-.084.364-.18.597-.29l8.825-4.162.065-.03c.625-.295 1.193-.563 1.664-.706Z" fill="#000">
                            </path>
                        </svg>
                    </div>
                </div>
                
            </div>
            <div className={`${styles.menu} ${showMenu ? styles.visible : styles.hidden}`}>
                <a href='#'>АПК</a>
                <a href='#'>Туризм</a>
                <a href='#'>ESG</a>
                <a href='#'>Госсектор</a>
                <a href='#'>ТМТ</a>
                <a href='#'>Промышленность</a>
                <a href='#'>Торговля</a>
                <a href='#'>Транспорт</a>
                <a href='#'>Недвижимость</a>
                <a href='#'>Финансы</a>
                <a href='#'>ВЭД</a>
            </div>
        </header>
    )
}

export default Header;